ExploreEmbedded/Pic16f877a_ExploreUltraPicDevKit/Code/SampleCode/00-libfiles/glcd.c
GLCD_Config GLCD;

/**************************************************************************************************
								void GLCD_Init()
***************************************************************************************************
 * I/P Arguments:  none
 * Return value	: none

 * description  :This function is used to initialize the graphic lcd.
                 *It initializes the LCD for selected mode 8-bit
**************************************************************************************************/
void GLCD_Init()
{
    GlcdDataBusDirnReg = 0x00;  // Configure all the LCD pins as output
    GlcdCtrlBusDirnReg &= ~((1<<RS)|(1<<RW)|(1<<EN)|(1<<CS1)|(1<<CS2)); // Configure the Ctrl pins as output

	/* Select the Page0/Page1 and Enable the GLCD */
	glcd_SelectPage0();
	glcd_CmdWrite(0x3f);
	glcd_SelectPage1();
	glcd_CmdWrite(0x3f);
	DELAY_ms(10);

	/* Select the Page0/Page1 and Enable the GLCD */
	glcd_SelectPage0();
	glcd_CmdWrite(0xc0);
	glcd_SelectPage1();
	glcd_CmdWrite(0xc0);
	GLCD_GoToPage(0);

	/* Clear the complete LCD during init */
	GLCD_Clear();

	/* Set the cursor to beginning of page0 */
	GLCD.PageNum=0;
	GLCD.LineNum=0xB8;
	GLCD.CursorPos=0x40;
	GLCD_GoToPage(0);
}







/***************************************************************************************************
                       void GLCD_DisplayChar( char v_lcdData_u8)
****************************************************************************************************
 * I/P Arguments: ASCII value of the char to be displayed.
 * Return value    : none

 * description  : This function sends a character to be displayed on LCD.
                  Any valid ascii value can be passed to display respective character

****************************************************************************************************/
void GLCD_DisplayChar(uint8_t ch)
{
	uint8_t dat,i=0;


	if(((GLCD.PageNum == 0x01) && ((GLCD.CursorPos+FONT_SIZE)>=128)) || (ch=='\n'))
	{
		/* If the cursor has reached to end of line on page1
		OR NewLine command is issued Then Move the cursor to next line */
		GLCD_GoToNextLine();
	}
	if(ch!='\n') /* TODO */
	{
		ch = ch-0x20; // As the lookup table starts from Space(0x20)

		while(1)
		{
			if((GLCD.PageNum == 0x00) && (GLCD.CursorPos==0x80))
			{
				/* If the cursor has reached to end of line on page0
				     Then Move the cursor to Page1 */
				GLCD_GoToPage(1);
			}

			dat= A_GlcdFontTable_U8[ch][i]; /* Get the data to be displayed for LookUptable*/


			glcd_DataWrite(dat); /* Display the data and keep track of cursor */
			GLCD.CursorPos++;

			i++;

			if(i==FONT_SIZE) /* Exit the loop if End of char is encountered */
			{
				glcd_DataWrite(0x00); /* Display the data and keep track of cursor */
				GLCD.CursorPos++;
				break;
			}
		}
	}
}








/***************************************************************************************************
                       void GLCD_DisplayString(char *ptr_stringPointer_u8)
****************************************************************************************************
 * I/P Arguments: String(Address of the string) to be displayed.
 * Return value    : none

 * description  :
               This function is used to display the ASCII string on the lcd.
                 1.The ptr_stringPointer_u8 points to the first char of the string
                    and traverses till the end(NULL CHAR)and displays a char each time.

****************************************************************************************************/
void GLCD_DisplayString(uint8_t *ptr)
{
	while(*ptr)
		GLCD_DisplayChar(*ptr++);
}





/***************************************************************************************************
               void GLCD_ScrollMessage(uint8_t v_lineNumber_u8, char *ptr_msgPointer_u8)
****************************************************************************************************
 * I/P Arguments: 
                  uint8_t  : Line number on which the message has to be scrolled
                  char *: pointer to the string to be scrolled                      

 * Return value    : none

 * description  :This function scrolls the given message on the specified line.
                 If the specified line number is out of range then the message
                 will be scrolled on first line
****************************************************************************************************/
#if (Enable_GLCD_ScrollMessage == 1)
void GLCD_ScrollMessage(uint8_t lineNum, char *strptr)
{
	unsigned char i,j,k,l,cursor,ch;


	if(lineNum > 7)
		lineNum = 0; // Select first line if the var_lineNumber_u8 is out of range



	for(i=0;strptr[i];i++)
	{
		/* Loop to display the complete string,    each time 16 chars are displayed and
        pointer is incremented to point to next char */

		for(k=0;k<6;k++)
		{
			GLCD_SetCursor(lineNum,6-k);     //Move the Cursor to first line
      cursor = 6-k;
			
			for(j=0;strptr[i+j] && (cursor<128);j++)
			{
				ch = strptr[i+j]-0x20;
				for(l=0;(l<5) && (cursor<128);l++)//Display first 16 Chars or till Null char is reached
				{
				  glcd_DataWrite(A_GlcdFontTable_U8[ch][l]);
					cursor++;
		   	  if(cursor==64)  /* Has the cursor reached end of page0 */
			    {
			   	  glcd_SelectPage1(); /*  then set it to beginning of page1 */
						glcd_CmdWrite(C_FirstLineAddress_U8+lineNum);	
			   	  glcd_CmdWrite(0x40);				
					
		     	}									
				}	
				
				 glcd_DataWrite(0);
					cursor++;
		   	  if(cursor==64)  /* Has the cursor reached end of page0 */
			    {
			   	  glcd_SelectPage1(); /*  then set it to beginning of page1 */
						glcd_CmdWrite(C_FirstLineAddress_U8+lineNum);	
			   	  glcd_CmdWrite(0x40);				
					
		     	}				
			}
			
			while(cursor < 128)
			{
				DELAY_us(10);
				cursor++;
			}

			DELAY_ms(20);
		}
	}
}	
#endif





/***************************************************************************************************
void GLCD_DisplayNumber(uint8_t v_numericSystem_u8, uint32_t v_number_u32, uint8_t v_numOfDigitsToDisplay_u8)
****************************************************************************************************
 * Function name:  GLCD_DisplayNumber()
 * I/P Arguments: 
                  uint8_t :  specifies type of number C_BINARY_U8(2),C_DECIMAL_U8(10), C_HEX_U8(16)
                  uint32_t: Number to be displayed on the LCD.
                  uint8_t : Number of digits to be displayed
                  
 * Return value    : none

 * description  :This function is used to display a max of 10digit decimal/Hex number OR specified 
                 number of bits for binary number.
                
                1st parameter specifies type of number C_BINARY_U8(2),C_DECIMAL_U8(10), C_HEX_U8(16)                 
                3rd parameter specifies the number of digits from the right side to be displayed
                 The output for the input combinations is as below
               
    Binary:     1.(2,10,4) then 4-LSB will be displayed ie. 1010
                2.(C_BINARY_U8,10,8) then 8-LSB will be displayed ie. 00001010
                3.(C_BINARY_U8,10,2) then 2-LSB will be displayed ie. 10
                
    Decimal:    4.(10,12345,4) then 4-digits ie. 2345 will be displayed
                5.(C_DECIMAL_U8,12345,6) then 6-digits ie. 012345 will be displayed
                6.(10,12345,C_DisplayDefaultDigits_U8) then 12345 will be displayed.\
                
