ExploreEmbedded/Pic16f877a_ExploreUltraPicDevKit/Code/SampleCode/00-libfiles/glcd.c
 * description  :This function moves the Cursor to beginning of the specified page.
        If the requested page number is out of range, it will not move the cursor.
****************************************************************************************************/
void GLCD_GoToPage(uint8_t pageNumber)
{

	if((pageNumber==0) || (pageNumber ==1))
	{ /* for 128/64 GLCD only page 0&1 are supported.
		Select the specified page and move the cursor accordingly */
		if(pageNumber == 0)
		{

			glcd_SelectPage0();
		}
		else
		{
			glcd_SelectPage1();
		}

		GLCD.PageNum=pageNumber;
		GLCD.CursorPos=0x40;
		glcd_CmdWrite(GLCD.LineNum);
		glcd_CmdWrite(GLCD.CursorPos);
	}
}





/***************************************************************************************************
                         void GLCD_GoToLine(uint8_t v_lineNumber_u8)
****************************************************************************************************
 * I/P Arguments: uint8_t: Line number(0-7).
 * Return value    : none

 * description  :This function moves the Cursor to beginning of the specified line.
        If the requested line number is out of range, it will not move the cursor.

 Note: The line numbers run from 0 to 7
****************************************************************************************************/
void  GLCD_GoToLine(uint8_t lineNumber)
{
	if(lineNumber<8)
	{   /* If the line number is within range
	     then move it to specified line on page0 and keep track*/
		GLCD.LineNum = lineNumber+C_FirstLineAddress_U8;
		GLCD_GoToPage(0);
	}
}






/***************************************************************************************************
                         void  GLCD_GoToNextLine()
****************************************************************************************************
 * I/P Arguments: none
 * Return value    : none

 * description  :This function moves the Cursor to beginning of the next line.
        If the cursor is on last line and NextLine command is issued then 
        it will move the cursor to first line.
****************************************************************************************************/
void  GLCD_GoToNextLine()
{
	/*Increment the current line number.
	  In case it exceeds the limit, rool it back to first line */
	GLCD.LineNum++;
	if(GLCD.LineNum > C_LastLineAddress_U8)
		GLCD.LineNum = C_FirstLineAddress_U8;
	GLCD_GoToPage(0); /* Finally move it to next line on page0 */
}







/***************************************************************************************************
                void GLCD_SetCursor(char v_lineNumber_u8,char v_charNumber_u8)
****************************************************************************************************
 * I/P Arguments: char row,char col
                 row -> line number(line1=1, line2=2),
                        For 2line LCD the I/P argument should be either 1 or 2.
                 col -> char number.
                        For 16-char LCD the I/P argument should be between 0-15.
 * Return value    : none

 * description  :This function moves the Cursor to specified position

                   Note:If the Input(Line/Char number) are out of range 
                        then no action will be taken
****************************************************************************************************/
void GLCD_SetCursor(uint8_t lineNumber,uint8_t CursorPosition)
{

	uint8_t pageNumber;

	if((lineNumber <= C_GlcdLastLine_U8) && (CursorPosition <= 128))
	{
		pageNumber = CursorPosition / 64; //Divide the cursor pos by 64 to get the page
		CursorPosition = CursorPosition % 0x3f; // Cusror pos should be within 64(0x3f),
		if(pageNumber==0x00)  /* Check for page number and set accordingly */
		{
			glcd_SelectPage0();
		}
		else
		{
			glcd_SelectPage1();
		}

		GLCD.PageNum = pageNumber; /* Keep the track of page selected */
		GLCD.LineNum=lineNumber | C_FirstLineAddress_U8; /* Select the specified line number */
		GLCD.CursorPos=CursorPosition |0x40; /* Select the specified cursor position */

		glcd_CmdWrite(GLCD.CursorPos); /* Command the LCD to move to specified page,line,cursor*/
		glcd_CmdWrite(GLCD.LineNum);
	}
}




/***************************************************************************************************
                       void GLCD_DisplayLogo(char *ptr_Logo)
****************************************************************************************************
 * I/P Arguments   : Array Bit Map(Address of Bit Map) to be displayed.
 * Return value    : none

 * description  :
               This function is used to display the logo for using the bit map.
               User should pass the array/address of bitmap for diplay the logo.
               User can enable/disable the inversion of the dislpay by using the below functions.
               GLCD_EnableInversion/GLCD_DisableInversion
****************************************************************************************************/
#if (Enable_GLCD_DisplayLogo == 1)
void GLCD_DisplayLogo(const char ptr_Logo[])
{
	uint8_t line,cursor;

	for(line=0;line<8;line++)
	{
		glcd_SelectPage0();
    	glcd_CmdWrite(0x40);
		glcd_CmdWrite(C_FirstLineAddress_U8+line);
		for(cursor=0;cursor<128;cursor++)
		{
			if(cursor==64)
			{
				glcd_SelectPage1();
				glcd_CmdWrite(0x40);
				glcd_CmdWrite(C_FirstLineAddress_U8+line);
			}
			glcd_DataWrite(*ptr_Logo++);
		}
	}
}
#endif





/***************************************************************************************************
void GLCD_VerticalGraph(uint8_t var_barGraphNumber_u8, uint8_t var_percentageValue_u8)
 ****************************************************************************************************
 * I/P Arguments   : var_barGraphNumber_u8 : position of bar ( 0 to 3 )
                     var_percentageValue_u8 : value of the bar in percentage(0-100)
 * Return value    : none

 * description  :
               	This function displays bar graph in horizontal direction.
 ****************************************************************************************************/
#if (ENABLE_GLCD_VerticalGraph ==1)
void GLCD_VerticalGraph(uint8_t var_barGraphNumber_u8, uint8_t var_percentageValue_u8)
{
    uint8_t var_lineNumberToStartDisplay_u8,i,j,var_barGraphPosition_u8;
    uint8_t lineNumber,var_valueToDisplay_u8;

 
    if((var_barGraphNumber_u8 < C_MaxBarGraphs_U8) && (var_percentageValue_u8<=100))
    {
        var_barGraphPosition_u8 = var_barGraphNumber_u8 * 32;

        GLCD_SetCursor(0,var_barGraphPosition_u8+8);
        GLCD_DisplayNumber(E_DECIMAL,var_percentageValue_u8,3);
        
        
        /* Divide the value by 8, as we have 8-pixels for each line */
        var_percentageValue_u8 = var_percentageValue_u8/2;
        var_lineNumberToStartDisplay_u8 = (var_percentageValue_u8>>3);
        lineNumber = 7-var_lineNumberToStartDisplay_u8;
        

        for(i=1;i<8;i++) 
        {
            GLCD_SetCursor(i,(var_barGraphPosition_u8+12));
            if(i<lineNumber)
            {
                var_valueToDisplay_u8 = 0x00;
            }
            else if(i== lineNumber)
            {
                var_valueToDisplay_u8 = util_GetMod8(var_percentageValue_u8,8);
                var_valueToDisplay_u8 = (0xff<<(8-var_valueToDisplay_u8));
            }
            else
            {
                var_valueToDisplay_u8 = 0xff;
            }
            
