ExploreEmbedded/Pic16f877a_ExploreUltraPicDevKit/Code/SampleCode/00-libfiles/glcd.c
            for(j=0;j<12;j++)
            {                
                glcd_DataWrite(var_valueToDisplay_u8);
            }
        }
    }
}
#endif




/***************************************************************************************************
	void GLCD_DisplayHorizontalGraph(uint8_t var_barGraphNumber_u8, uint8_t var_percentageValue_u8)
 ****************************************************************************************************
 * I/P Arguments   : var_barGraphNumber_u8 : position of bar ( 0 to 3 )
                     var_percentageValue_u8 : value of the bar in percentage(0-100)
 * Return value    : none

 * description  :
               	This function displays bar graph in vertical direction.
 ****************************************************************************************************/
#if (ENABLE_GLCD_HorizontalGraph ==1)
void GLCD_HorizontalGraph(uint8_t var_barGraphNumber_u8, uint8_t var_percentageValue_u8)
{
    uint8_t var_lineNumber_u8,i;
    var_lineNumber_u8 = (var_barGraphNumber_u8 * 2)+1;
    
    if((var_barGraphNumber_u8 < C_MaxBarGraphs_U8) && (var_percentageValue_u8<=100))
    {
        GLCD_GoToPage(0);
        GLCD_SetCursor(var_lineNumber_u8,0);
        
        for(i=0;i<var_percentageValue_u8;i++)
        {
            if(i==64)
            GLCD_GoToPage(1);
            
            glcd_DataWrite(0xff);
            
        }
        
        for(i=var_percentageValue_u8;i<100;i++)
        {
            if(i==64)
            GLCD_GoToPage(1);
            
            glcd_DataWrite(0x00);
        }
        
        GLCD_SetCursor(var_lineNumber_u8,105);

        GLCD_DisplayNumber(E_DECIMAL,var_percentageValue_u8,3);
    }
}
#endif



/***************************************************************************************************
                       void GLCD_EnableInversion(void)
****************************************************************************************************
 * I/P Arguments   : none.
 * Return value    : none

 * description  :
               This function is used to Enable the display inversion.
               Once this is enabled the background pixels will be turned ON and char pixels will be OFF.

****************************************************************************************************/
#if (Enable_GLCD_EnableInversion == 1)
void GLCD_EnableInversion(void)
{
    GLCD.Invertdisplay = 0xFF;
}
#endif







/***************************************************************************************************
                       void GLCD_DisableInversion(void)
****************************************************************************************************
 * I/P Arguments   : none.
 * Return value    : none

 * description  :
               This function is used to clear the display inversion.

****************************************************************************************************/
#if (Enable_GLCD_DisableInversion == 1)
void GLCD_DisableInversion(void)
{
    GLCD.Invertdisplay = 0x00;
}
#endif





/***************************************************************************************************
                                         Local Functions
***************************************************************************************************/
void glcd_CmdWrite( uint8_t cmd)
{
	glcd_BusyCheck();
	GlcdDataBus = cmd;
	GlcdClearBit(RS);	  // Select the Command Register by pulling RS LOW
	GlcdClearBit(RW);	   // Select the Write operation by pulling RW LOW
	GlcdSetBit(EN);		   // Send a High-to-Low Pulse at Enable Pin
	DELAY_us(1);
	GlcdClearBit(EN);
}




void glcd_DataWrite( uint8_t dat)
{
	glcd_BusyCheck();
	GlcdDataBus = dat ^ GLCD.Invertdisplay;
	GlcdSetBit(RS);							// Select the Data Register by pulling RS LOW
	GlcdClearBit(RW);						// Select the Write operation by pulling RW LOW
	GlcdSetBit(EN);						   // Send a High-to-Low Pulse at Enable Pin
	DELAY_us(1);
	GlcdClearBit(EN);
}




void glcd_SelectPage0()
{
	GlcdSetBit(CS1);
	GlcdClearBit(CS2);
}



void glcd_SelectPage1()
{
	GlcdSetBit(CS2);
	GlcdClearBit(CS1);
}





void glcd_BusyCheck()
{	
#ifdef BUSY_CHECK_EN            //Perform Busy check if LCD_RW pin is used
	uint8_t busyflag;

	util_UpdateBit(GlcdDataBus,BUSY_FLAG,C_PinInput_U8); // Configure busy pin as input
	GlcdClearBit(RS);           // Select the Command Register by pulling RS LOW
	GlcdSetBit(RW);             // Select the Read Operation for busy flag by setting RW
	do
	{

		GlcdClearBit(EN);             // Send a High-to-Low Pulse at Enable Pin
		DELAY_us(10);
		GlcdSetBit(EN);
		DELAY_us(10);
		busyflag = util_GetBitStatus(GlcdDataBus,BUSY_FLAG);
	}while(busyflag);
#else
	/* Busy flag cannot be read as LCD_RW is not available hence Extra delay of 10us is added
	  to ensure the LCD completes previous operation and ready to receive new commands/data */
	DELAY_us(10);
#endif
}
/***************************************************************************************************
                                         End of Local Functions
***************************************************************************************************/

#pragma warning pop
